In [35]:
import pandas as pd
from datetime import datetime
from datetime import date
from datetime import time
from datetime import timedelta

## date

In [2]:
date.today()

datetime.date(2019, 2, 7)

In [3]:
today = date.today()
print("Date Components: ", today.day, today.month, today.year)

Date Components:  7 2 2019

weekday number with monday equals to 0

In [4]:
today.weekday()

3

## datetime

In [5]:
# print the current time without the date
datetime.time(datetime.now()) # hour, minute, second, microsecond

datetime.time(23, 38, 53, 372571)

In [6]:
datetime.now()

datetime.datetime(2019, 2, 7, 23, 38, 54, 52223)

## strftime function

In [7]:
now = datetime.now()

In [8]:
now

datetime.datetime(2019, 2, 7, 23, 38, 55, 812689)

In [9]:
now.strftime("%I:%M:%S %p") # printout the time in anyformat you want

'11:38:55 PM'

**strptime**: parse(convert) string to datetime object. <br/>
**strftime**: create formatted string for given time/date/datetime object according to specified format </br>

## timedelta objects

In [10]:
now

datetime.datetime(2019, 2, 7, 23, 38, 55, 812689)

In [11]:
now + timedelta(hours = 5)

datetime.datetime(2019, 2, 8, 4, 38, 55, 812689)

In [14]:
print("microseconds:", timedelta(microseconds=1))
print("milliseconds:", timedelta(milliseconds=1))
print("seconds     :", timedelta(seconds=1))
print("minutes     :", timedelta(minutes=1))
print("hours       :", timedelta(hours=1))
print("days        :", timedelta(days=1))
print("weeks       :", timedelta(weeks=1))

microseconds: 0:00:00.000001
milliseconds: 0:00:00.001000
seconds     : 0:00:01
minutes     : 0:01:00
hours       : 1:00:00
days        : 1 day, 0:00:00
weeks       : 7 days, 0:00:00

## ISO 8601

In [38]:
datetime.now().isoformat()

'2019-02-07T23:52:14.479310'

In [39]:
dt = "2007-03-04T21:08:12"
datetime.strptime( dt, "%Y-%m-%dT%H:%M:%S" )

datetime.datetime(2007, 3, 4, 21, 8, 12)

## Combine date & time

In [22]:
today =date.today()
moment = datetime.now().time()

In [23]:
today

datetime.date(2019, 2, 7)

In [24]:
moment

datetime.time(23, 45, 7, 153943)

In [26]:
now = datetime.combine(today, moment)

In [27]:
now

datetime.datetime(2019, 2, 7, 23, 45, 7, 153943)

## Real Life Example

In [15]:
data = pd.read_csv("4_4_data/SalesJan2009.csv")

In [16]:
data.head(2)

,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country,Account_Created,Last_Login,Latitude,Longitude
0,1/2/09 6:17,Product1,1200,Mastercard,carolina,Basildon,England,United Kingdom,1/2/09 6:00,1/2/09 6:08,51.500,-1.116667
1,1/2/09 4:53,Product1,1200,Visa,Betina,Parkville,MO,United States,1/2/09 4:42,1/2/09 7:49,39.195,-94.681940

In [17]:
data.Transaction_date = [datetime.strptime(x, "%m/%d/%y %H:%M").strftime("%Y-%m-%d %H:%M:%S") for 
                         x in data.Transaction_date]

In [18]:
data = data.set_index('Transaction_date')

In [19]:
data = data.sort_index()

In [20]:
data.head()

,Product,Price,Payment_Type,Name,City,State,Country,Account_Created,Last_Login,Latitude,Longitude
Transaction_date,,,,,,,,,,,
2009-01-01 01:26:00,Product1,1200,Mastercard,Nikki,New Rochelle,NY,United States,1/1/09 0:58,1/10/09 21:31,40.911390,-73.782780
2009-01-01 01:51:00,Product1,1200,Mastercard,Si,Holte,Kobenhavn,Denmark,12/14/05 15:46,1/18/09 4:44,55.816667,12.466667
2009-01-01 02:09:00,Product1,1200,Mastercard,Saraya,Dresden,Saxony,Germany,3/12/06 11:31,1/20/09 11:56,51.050000,13.750000
2009-01-01 02:24:00,Product1,1200,Visa,Lisa,Sugar Land,TX,United States,1/1/09 1:56,1/7/09 10:52,29.619440,-95.634720
2009-01-01 03:51:00,Product1,1200,Mastercard,sunny,Amsterdam,Noord-Holland,Netherlands,9/14/05 22:53,1/17/09 22:34,52.350000,4.916667